package com.itis.summerpractice

object MonkeyRepository {
    val list: List<Monkey> = listOf(
        Monkey(1, "Носач", "Вид приматов из подсемейства тонкотелых обезьян в составе семейства мартышковых. Распространён исключительно на острове Калимантан, где населяет прибрежные регионы и долины.", "https://damion.club/uploads/posts/2022-02/1643961667_56-damion-club-p-nosach-obezyana-prikolnie-zhivotnie-58.jpg"),
        Monkey(2, "Золотая мартышка", "Вид обезьян Старого Света, обитающий в вулканических горах Вирунга в Центральной Африке, включая четыре национальных парка: Мгахинга на юго-западе Уганды; Вулканы на северо-западе Руанды; и Вирунга и Кахузи-Биега на востоке Демократической Республики Конго.", "https://funart.pro/uploads/posts/2021-04/1618228704_28-p-zolotistaya-kurnosaya-obezyana-zhivotnie-k-31.jpg"),
        Monkey(3, "Императорский тамарин", "Вид игрунковых обезьян из рода тамаринов.", "https://avatars.dzeninfra.ru/get-zen_doc/5042160/pub_636a998f83b7e10187cc2fec_636d1883d20f2a7c8e7aa1bb/scale_1200"),
        Monkey(4, "Лысый уакари", "Вид приматов Нового Света из семейства саковых. Его особо заметным признаком является красное безволосое лицо, а ареал охватывает северо-запад южноамериканского континента. Лысый уакари живёт в крупных группах и питается главным образом плодами.", "https://www.atozpictures.com/uploads/2022/07/bald-uakari-on-tree.jpg"),
        Monkey(5, "Мандрил", "Вид приматов из семейства мартышковых. Вместе с дрилами включён в род мандрилов.", "https://i.pinimg.com/originals/03/73/e6/0373e690e187e8419939922914e0c8e8.jpg"),
        Monkey(6, "Японский макак", "Один из видов макак. Популяцию с острова Якусима, представители которой отличаются более короткой шерстью и рядом поведенческих особенностей культурного характера, выделяют в отдельный подвид Macaca fuscata yakui.", "https://faunistics.com/wp-content/uploads/2021/11/10-9.jpg"),
        Monkey(7, "Карликовая игрунка", "Род приматов из семейства игрунковых. Включает одних из самых маленьких представителей всего отряда приматов.", "https://i1.wp.com/img-fotki.yandex.ru/get/9502/137106206.43a/0_e6ffd_3f9c9494_orig.jpg"),
        Monkey(8, "Свинохвостый макак", "Вид приматов семейства мартышковых. Он находится в близком родстве с Macaca leonina.", "https://krasivosti.pro/uploads/posts/2021-09/1631197487_29-krasivosti-pro-p-svinokhvostaya-makaka-zhivotnie-krasivo-fo-31.jpg"),
        Monkey(9, "Бледный саки", "Вид приматов из семейства саковых.", "https://webpulse.imgsmail.ru/imgpreview?mb=webpulse&key=pulse_cabinet-image-48936279-f113-49c7-bd4d-c4d680a03422"),
        Monkey(10, "Колумбийская коата", "Примат семейства паукообразных обезьян.", "https://oir.mobi/uploads/posts/2020-02/1582021860_43-p-chernie-obezyani-koati-76.jpg"),
        Monkey(11, "Павиан анубис", "Вид приматов семейства мартышковых. Видовое название дано за внешнее сходство обезьян с изображениями древнеегипетского бога Анубиса, часто имевшими собачью голову. Раньше наряду с медвежьим и гвинейским павианами считался разновидностью бабуинов. Отмечено, что анубисы могут скрещиваться с бабуинами.", "https://novikovnn.ru/wp-content/uploads/3/7/6/376e03d7d3d70a9d0a2c9a7cbe28d28a.jpeg")
    )
}